ab_test.txt
        ПОЛУЧАЕМ ТОКЕН
TOKEN=$(curl -s -X POST http://localhost:8080/login \
  -H "Content-Type: application/json" \
  -d '{"email":"admin","password":"admin"}' | jq -r '.token')

        ТЕСТИРУЕМ
ab -n 10000 -c 100 -k -H "Cookie: token=$TOKEN" "http://localhost:8080/pvz?startDate=2025-01-01T00:00:00Z&endDate=2025-12-31T23:59:59Z&page=1&limit=10"
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /pvz?startDate=2025-01-01T00:00:00Z&endDate=2025-12-31T23:59:59Z&page=1&limit=10
Document Length:        2902 bytes

Concurrency Level:      100
Time taken for tests:   4.363 seconds
Complete requests:      10000
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      29900000 bytes
HTML transferred:       29020000 bytes
Requests per second:    2292.04 [#/sec] (mean)
Time per request:       43.629 [ms] (mean)
Time per request:       0.436 [ms] (mean, across all concurrent requests)
Transfer rate:          6692.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   2.2      1      14
Processing:     3   41  69.0     33     740
Waiting:        2   40  68.8     32     738
Total:          3   43  69.1     35     743

Percentage of the requests served within a certain time (ms)
  50%     35
  66%     42
  75%     46
  80%     49
  90%     57
  95%     64
  98%     76
  99%    690
 100%    743 (longest request)